#include <conio.h>
#include <stdio.h>
#include <stdlib.h>
#include <locale.h>
#include <math.h>


int main()
{
    _Bool start;
    int var;
    double X, X1, X2, delta, Y;
    unsigned int N;
    setlocale(LC_ALL, "Rus");

    {//шапка
        printf("\n\n\t++===================================================++\n");
        printf("\t||                   лаба   №1                       ||\n");
        printf("\t++---------------------------------------------------++\n");
        printf("\t||     Вывести таблицу значений функции по точкам    ||\n");
        printf("\t++===================================================++\n\n");
    }

    {//ввод начальных данных и вычисления
        printf("\t   Введите начальное число\t"); scanf("%lgf", &X1);
        printf("\t   Введите конечное число\t"); scanf("%lf", &X2);
        do
        {//выбор способа
         printf("\n\t\t 1 - через количество точек");
         printf("\n\t\t 2 - через шаг точек");
         printf("\n\t   Выберите способ вычисления точек:\t"); scanf("%d", &var);
        }
        while(var!=1&&var!=2);

         switch(var)//вычисление delta / N
         {
         case 1:
            {//через N
                printf("\n\t   Введите количество точек таблицы\t"); scanf("%u", &N);
                delta = (X2-X1)/(N-1);
            } break;
         case 2:
            {//через delta
                printf("\n\t   Введите шаг значений точек таблицы\t"); scanf("%lf", &delta);
                N = (X2-X1)/delta+1;
            } break;
         }
    }

    printf("\n\t\t=================================================================");
    printf("\n\t\t||          Клюевые данные таблицы f(x) = sqrt(x)*x/2:         ||", X1, X2, N, delta);
    printf("\n\t\t=================================================================");
    printf("\n\t\t||X1 = %lf || X2 = %lf || N = %ld || delta = %lf ||", X1, X2, N, delta);
    printf("\n\t\t=================================================================");
    printf("\n\n\t\tЕдиница - Да\n\t\tЛюбая иная клавиша - Нет\n\t Все верно?\t"); scanf("%d", &start);
    if (!start) {system("cls"); main();} else system("cls");

    {//верхняя строка таблицы
        printf("\n\n\t+=====================================================+\n");
        printf("\t|Номер|Значение переменной  |Значение функции         |\n");
        printf("\t+=====================================================+\n");

    }
    for(int i = 0; i < N; i++)
    {
        X = X1+delta*i;
        Y = sqrt(X)*X/2;
        printf("\t|%5d|%21f|%25f|\n", i+1, X, Y);
        printf("\t+-----+---------------------+-------------------------+\n");

        {//  задержка при заполнении консоли
        if(N > 10)
            if((i+1)% 10 == 0)
            if (i+1 == 10) {printf("\tНажмите любую клавишу для продолжения"); getch();printf("\r");}
              else getch();
        }
    }
    getch(); //для открытия файла .exe чтобы мгновенно не закрывалось
    return 0;
}
